## Plan Result (prod-video-hearings)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-VH-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-VH-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "894e4925-7c39-4297-9c27-7db854753689"
      + principal_type                   = (known after apply)
      + role_definition_id               = "159469f4-6e46-4b09-aa73-8e2f243aa784"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/0d4a44b0-abcf-44ff-80ef-ec139a3a5692"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":73,"Program":"tfcmt","SHA1":"","Target":"prod-video-hearings","Vars":{}} -->